# -*- eval: (setq org-download-image-dir (concat default-directory "./static/数据类型和流程控制/")); -*-
:PROPERTIES:
:ID:       3347E201-B16C-42EF-A729-E655C86848B6
:END:
#+LATEX_CLASS: my-article

#+DATE: <2020-09-05 Sat 13:10>
#+TITLE: 数据类型和流程控制

** 为什么需要输出控制符
- ~01~ 组成的代码可以表示数据也可以表示指令
- 如果 ~01~ 组成的代码表示的是数据的话，那么相同的 ~01~ 代码组合以不同的输出格式输出就会有不同的输出结果

#+BEGIN_SRC C :results output list :exports no-eval
# include <stdio.h>

int main(void)
{
    int i = 10;
    printf("%o\n", i);        // 注意：这里“%o”是字母“o”不要与字符串八进制表示“012”混淆，所以就认为应该是使用数字0
    printf("%#o\n", i);       // 八进制，以“0”开头表示
    printf("%x\n", i);        // 十六进制，小写字母表示
    printf("%X\n", i);        // 十六进制，大写字母表示
    printf("%#x\n", i);       // 十六进制，以“0x”开头表示，小写字母表示
    printf("%#X\n", i);       // 十六进制，以“0X”开头表示，大写字母表示
}
#+END_SRC

#+RESULTS:
: - 12
: - 012
: - a
: - A
: - 0xa
: - 0XA

总结 =%#x= 表示格式化输出十六进制 =0x= 开头(小写 x)， =%#X= 表示格式化输出十六进制 =0X= 开头（大写 X），如果没有 =#= 则没有 =0x= 或者 =0X= 开头的十六进制输出，对于八进制一样的道理。

** 输出一个变量的地址

#+BEGIN_EXAMPLE
# include <stdio.h>
int main(void)
{
    int a[5] = {1, 2, 3, 4, 5};
    printf("%p\n", a);
    /* printf("%#X\n", a); */
    return 0;
}
#+END_EXAMPLE

编译时出现错误:

#+BEGIN_EXAMPLE
test.c: In function ‘main’:test.c:8:12: warning: format ‘%X’ expects argument of type ‘unsigned int’, but argument 2 has type ‘int *’ [-Wformat=]     printf("%#X\n", a);            ^
#+END_EXAMPLE

#+BEGIN_SRC C :results output list :exports no-eval
# include <stdio.h>

int main(void)
{
    int a[5] = {1, 2, 3, 4, 5};
    printf("%p\n", a);
    printf("%p\n", a+1);
    printf("%p\n", a+2);
    printf("%p\n", a+3);
    printf("%p\n", &a[4]);
    printf("%p\n", &a[5]);
    printf("%d\n", *(a+5));
    return 0;
}
#+END_SRC

#+RESULTS:
: - 0x7ffee7da56c0
: - 0x7ffee7da56c4
: - 0x7ffee7da56c8
: - 0x7ffee7da56cc
: - 0x7ffee7da56d0
: - 0x7ffee7da56d4
: - 32766

